swak4Foam/Examples/other/capillaryRiseRefine/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

convertToMeters 0.001;

vertices
  (
    (0 0 0)
    (1 0 0)
    (1 20 0)
    (0 20 0)
    (0 0 1)
    (1 0 1)
    (1 20 1)
    (0 20 1)
  );

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (20 400 20)
    simpleGrading
    (1 1 1)
  );

edges
  (
  );

patches
  (
    patch
    inlet

    (

      (
        1
        5
        4
        0
      )
    )
    patch
    atmosphere

    (

      (
        3
        7
        6
        2
      )
    )
    wall
    walls

    (

      (
        0
        4
        7
        3
      )

      (
        2
        6
        5
        1
      )
      (
          0
          3
          2
          1
      )

      (
          4
          5
          6
          7
      )
    )
    empty
    frontAndBack

    (

    )
  );

mergePatchPairs
  (
  );

boundary
  (
    inlet

    {
      faces
        (

          (
            1
            5
            4
            0
          )
        );
      type patch;

    }
    atmosphere

    {
      faces
        (

          (
            3
            7
            6
            2
          )
        );
      type patch;

    }
    walls

    {
      faces
        (

          (
            0
            4
            7
            3
          )

          (
            2
            6
            5
            1
          )
        );
      type wall;

    }
    frontAndBack

    {
      faces
        (

          (
            0
            3
            2
            1
          )

          (
            4
            5
            6
            7
          )
        );
      type empty;

    }
  );
